Repository: bb-io/Utilities
Catalog: Tests.Utilities/Input/Starting a flight.xliff
Languages: de

source: Starting a flight
de: Start eines Fluges

source: Blackbird is an integration platform-as-a-service (iPaaS) solution.<bpt id="1">&lt;p&gt;</bpt>At Blackbird, our integration platform revolves around Birds. All the time.<ept id="1">&lt;/p&gt;</ept>
de: Blackbird ist eine Integrationsplattform-as-a-Service (iPaaS) Lösung.<bpt id="1">&lt;p&gt;</bpt>Bei Blackbird dreht sich unsere Integrationsplattform um Birds. Die ganze Zeit.<ept id="1">&lt;/p&gt;</ept>

source: We can solve the problem of applications operating in isolation and in dispersed modalities by enabling integration, automation, and seamless analytics between the apps, data, content, participants, and devices used for localization and globalization management. However, Blackbird goes beyond connecting applications, data, and content within an organization. It can also connect organizations into networks - e.g. the end clients who create the content with multiple localization vendors.​
de: Wir können das Problem der isoliert und verstreut arbeitenden Anwendungen lösen, indem wir Integration, Automatisierung und nahtlose Analysen zwischen den Anwendungen, Daten, Inhalten, Teilnehmern und Geräten ermöglichen, die für das Lokalisierungs- und Globalisierungsmanagement verwendet werden. Blackbird geht jedoch über die Verbindung von Anwendungen, Daten und Inhalten innerhalb einer Organisation hinaus. Es kann auch Organisationen in Netzwerken verbinden - z.B. die Endkunden, die den Inhalt mit mehreren Lokalisierungsanbietern erstellen

source: Our mission is to become the global language services industry’s best iPaaS and automation-platform-as-a-service technology vendor.
de: Unser Ziel ist es, der beste iPaaS- und Automatisierungsplattform-as-a-Service-Technologieanbieter für die globale Sprachdienstleistungsbranche zu werden.

source: At Blackbird, our integration platform revolves around Birds. All the time.
de: Bei Blackbird dreht sich unsere Integrationsplattform um Birds. Die ganze Zeit.

source: Lines of code are transformed into the four forces of flight: lift (triggers), weight (actions), thrust (apps), and drag (connections). The way the four forces act on your Bird makes it do different things. Fine, but how, you could ask.
de: Codezeilen werden in die vier Kräfte des Fluges umgewandelt: Auftrieb (Auslöser), Gewicht (Aktionen), Schub (Anwendungen) und Widerstand (Verbindungen). Die Art und Weise, wie die vier Kräfte auf deinen Vogel wirken, lässt ihn verschiedene Dinge tun. Gut, aber wie, könnten Sie fragen.

source: Think about the apps you use for your business. Your initial list should have at least one e-mail client, project management software, translation memory software or billing software. You can connect and make them communicate with each other in Blackbird.
de: Überlegen Sie, welche Anwendungen Sie für Ihr Unternehmen nutzen. Ihre erste Liste sollte mindestens einen E-Mail-Client, eine Projektmanagement-Software, eine Translation-Memory-Software oder eine Rechnungssoftware enthalten. Sie können diese miteinander verbinden und in Blackbird miteinander kommunizieren lassen.

source: <bpt id="1">&lt;strong&gt;</bpt>Let's assume that you get a request for a quote from a client of yours in an e-mail.<ept id="1">&lt;/strong&gt;</ept> Normally you would open the e-mail, save the file you receive, create a project in your project management software and copy info from the email there, open your translation memory software, run an analysis on the file, and finally open your billing software and generate the quote based on the CAT analysis.
de: <bpt id="1">&lt;strong&gt;</bpt>Nehmen wir an, Sie erhalten von einem Ihrer Kunden eine Anfrage für ein Angebot in einer E-Mail.<ept id="1">&lt;/strong&gt;</ept> Normalerweise würden Sie die E-Mail öffnen, die erhaltene Datei speichern, ein Projekt in Ihrer Projektmanagement-Software anlegen und die Informationen aus der E-Mail dorthin kopieren, Ihre Translation-Memory-Software öffnen, eine Analyse der Datei durchführen und schließlich Ihre Abrechnungssoftware öffnen und das Angebot auf der Grundlage der CAT-Analyse erstellen.

source: On the other hand, at Blackbird, you can create this workflow as a Bird, run it in an automated way - and use it in Flights; yes, we love aviation.
de: Andererseits können Sie bei Blackbird diesen Workflow als Bird erstellen, ihn automatisiert ablaufen lassen - und ihn in Flights verwenden; ja, wir lieben die Luftfahrt.

source: First of all your Bird will need a&nbsp;<em>trigger</em>&nbsp;- the request for quote email from your client in this example. From now on&nbsp;<em>when</em>&nbsp;you get an email from this client, your Bird will automatically run the series of&nbsp;<em>actions</em>&nbsp;you define in the next step(s) - like saving the file, creating the project, copying the info from the body of the email, opening the translation memory software, running analysis, and generating the quote. Once you published your Bird it is used in Flights. As simple as that.
de: Zuallererst braucht Ihr Bird einen&nbsp;<em>Auslöser</em>&nbsp;- in diesem Beispiel die E-Mail mit der Angebotsanfrage Ihres Kunden. Von nun an&nbsp;<em>wenn</em>&nbsp;Sie eine E-Mail von diesem Kunden erhalten, wird Ihr Bird automatisch die Reihe von&nbsp;<em>Aktionen</em>&nbsp;ausführen, die Sie in den nächsten Schritten festlegen - wie das Speichern der Datei, das Anlegen des Projekts, das Kopieren der Informationen aus dem Text der E-Mail, das Öffnen der Translation-Memory-Software, das Ausführen der Analyse und das Erstellen des Angebots. Sobald Sie Ihren Vogel veröffentlicht haben, wird er in Flights verwendet. So einfach ist das.
